package Chapter5;

import org.omg.Messaging.SYNC_WITH_TRANSPORT;

/**
 * For试题
 * @author：Wen
 * @version：1.0
 * @date：2021/3/30 16:37
 * @copyright 老九学堂
 * @remark TODO
 */
public class ForDemo {
    public static void main(String[] args) {
        /**
         * 1.操场上有100多人排队，三人一组多一人，四人一组多2人，五人一组多三人
         * 问：一共多少人？
         */
//        for (int i = 100; i < 200; i++){
//            if(i % 3 == 1 && i % 4 == 2 && i % 5 == 3){
//                System.out.println("一共多少有：" + i +"人");
//            }
//        }
//
        /**
         *2.甲乙丙丁一共加工零件370个，如果把甲做的个数+10，乙做的个数-20
         * 丙的个数*2，丁的个数/2，那么4人做的零件数相等
         * 问：甲一共做了几个零件
         * 穷举法
         */
        //假设i为甲工零件的数量
//        for (int i = 1; i < 367; i++){ //甲加工的数量
//            for (int j = 1; j < 367; j++){ //乙加工的数量
//                for (int k = 1; k < 367 ; k++){ //丁加工的数量
//                    int d = 370 - i - j - k;
//                    if (i + j + k + d == 370 && i + 10 == j - 20 && j - 20 == k * 2 && k * 2 == d / 2){
//                        System.out.println("甲一共做了"+ i + "个零件");
//                    }
//                }
//            }
//        }

        /**
         * 3.求1到500之间不含数字4的自然数共有多少？
         */
//        int count = 0;
//        for (int i = 1; i < 501 ; i++){
//            int a = i % 10; //个位
//            int b = i / 10 % 10; //十位
//            int c = i / 100; //百位
//            if (a == 4 || b == 4 || c == 4){
//                continue;
//            }
//            count++;
//        }
//        System.out.println("1到500之间不含数字4的自然数共有：" + count);

        /**
         * 4.两个自然数x，y相除，商3余10，被除数，除数，商，余数的和是163，求被除数、除数。
         * (115,35)
         */
//        for (int x = 1; x < 163; x++){
//            for (int y = 1; y < x; y++){  //也可以是int y =3; y < x / 3; y++
//                if(x / y == 3 && x % y == 10 && x + y + 3 + 10 == 163){
//                    System.out.println("x=" + x + "\ty=" + y);
//                }
//            }
//        }


        /**
         * 5.某数学竞赛中，参赛人数大约在380~450人之间。比赛结果，全体考生的总平均分为76分
         * 男生的平均分为75分，女生的平均分为80.1分，求男女生各有多少人？
         * 男：328，女：80
         */
//        int maleNum = 0,femaleNum = 0;
//        for (int i = 380; i < 450; i++){
//            for (maleNum = 0; maleNum < i; maleNum++){
//                femaleNum = i - maleNum;
//                if (maleNum * 75 + femaleNum * 80.1 == i * 76){
//                    System.out.println("男生：" + maleNum + "人" + "\t女生：" + femaleNum + "人");
//                }
//            }
//        }

        /**
         * 6.一个四位数，恰好等于去掉它的首位数字之后所剩的三位数的3倍，这个四位数是多少？
         * 1500
         */
//        for (int i = 1; i < 10000; i++){
//            if ((i % 1000) * 3 == i){
//                System.out.println(i);
//            }
//        }

        /**
         * 7.有一个两位数，如果在它前面添一个3，可得到一个三位数
         * 把3添在它的后面，也可以的到一个三位数。这两个三位数相差468，求原来的两位数
         * 85
         */
//        for (int i = 10;i < 99;i++){
//            int a = i + 300;
//            int b = i * 10 +3;
//            if (Math.abs(a - b) == 468){ //Math.abs = a-b的绝对值
//                System.out.println(i);
//            }
//        }

        /**
         * 8.要在[]、[]7、[]48这三个数中的每个[]内各填上1~9中的一个数字，
         * 使中间的两位数是左边的一位数和右边的三位数的平均数，求这三个数
         * 6 77 148
         */
//        for (int i = 1; i<= 9; i++){ //循环条件1~9中的一个数字
//            for (int j = 1; j <= 9; j++){
//                for (int k = 1; k <= 9; k++){
//                    int a = i;
//                    int b = j * 10 + 7;
//                    int c = k * 100 + 48;
//                    if ((double)(a + c) / 2.0 == b){
//                        System.out.println(a + "\t" + b + "\t" + c);
//                    }
//                }
//            }
//        }

        /**
         * 9.有红、白、黑三种球若干个，其中红、白球共25个，白、黑球共31个，红、黑球共28个，
         * 求这三种球各有多少个？
         * 11 14 17
         */
        //方法一：
//        for (int x = 1;x < 99; x++){
//            for(int y = 1;y < 99; y++){
//                for (int z = 1;z < 99; z++){
//                    if (x+y == 25 && y+z == 31 && x+z==28){
//                        System.out.printf("红球：%d个，白球：%d个，黑球：%d个",x,y,z);
//                    }
//                }
//            }
//        }

        //方法二：
//        for (int i = 1;i < 25; i++){ //红球的数量
//            for (int j = 0; j < 31; j++){ //白球的数量
//                int k = 31 - j; //黑球的数量
//                if (i + j == 25 && j+k == 31 && i+k == 28){
//                    System.out.printf("红球：%d个，白球：%d个，黑球：%d个",i,j,k);
//                }
//            }
//        }

        /**
         * 10.某人去购买教材和练习簿。已知教材每本10元，教参每本5元，练习簿每本0.5元
         * 他总共购买了100本，用了100元。问他购买材料、教参和练习簿各多少本？
         * 1 9 90
         */
//        for (int i = 1;i <= 100; i++){
//            for (int j = 1;j <= 100; j++){
//                int k = 100 - i - j;
//                if(i * 10 + j * 5 + k * 0.5 == 100){
//                    System.out.printf("教材：%d本，教参：%d本，练习簿：%d本",i,j,k);
//                }
//            }
//        }

        /**
         * 11.输出四位自然数中各位数之和为6并且各位数字互不相同的数，并统计个数。
         */
//         int count = 0;
//         for (int i = 1000; i < 10000; i++){
//             int a = i % 10; //得到个位
//             int b = i / 10 % 10; //得到十位
//             int c = i / 100 % 10; //得到百位
//             int d = i / 1000; //得到千位
//             if (a + b + c +d == 6 && a != b && a != c && a != d && b !=c && b !=d &&c != d) {
//                 System.out.print(i + "\t");
//                 count++;
//             }
//
//         }
//         System.out.print("总个数为：" + count);

        /**
         * 12.将100元纸币换成10元、5元和1元纸币共20张，输出各种兑换法，并统计个数。
         * 10元：4张，5元：11张，1元：5张
         * 10元：8张，5元：2张，1元：10张
         */
        for(int i = 1; i <= 20; i++){
            for (int j = 1;j <= 20;j++){
                int k = 20 - i - j;
                if (i * 10 + j * 5 + k == 100){
                    System.out.printf("10元：%d张，5元：%d张，1元：%d张\n",i,j,k);
                }
            }
        }

    }
}
